Revit 2027 API
BendingDetailCustomFieldProperties.LineStyleId Property
 Identifies the line style that is used for drawing Bending Detail curves.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId LineStyleId { get; set; }
Public Property LineStyleId As ElementId
	Get
	Set
public:
property ElementId^ LineStyleId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member LineStyleId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The lineStyleId should be an id of a line style.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace